# Mapping ของสัญชาติกับรหัส
nationality_mapping = {
    'ไทย': 'TH',
    'พม่า': 'MM',
    'กัมพูชา': 'KH',
    'ลาว': 'LA',
    'มาเลเซีย': 'MY',
    'อินโดนีเซีย': 'ID',
    'สิงคโปร์': 'SG',
    'เวียดนาม': 'VN',
    'ฟิลิปปินส์': 'PH',
    'จีน':'CN',
    'ไต้หวัน': 'TW',
    'ญี่ปุ่น': 'JP',
    'เกาหลีใต้': 'KR',
    'ไม่ระบุ': 'N/A'
}

sex_mapping = {
    'นาย': 'ชาย',
    'นางสาว': 'หญิง' ,
    'เด็กหญิง': 'หญิง'
}

# สร้างฟังก์ชันเพื่อกำหนดค่า types
def determine_type(row):
    if row['สัญชาติ'] == 'ไทย':
        return 'thai'
    elif row['เลขประจำตัวประชาชน'].startswith('G'):
        return 'g'
    else:
        return 'inter'